feat: many overhaul changes, including keycloak, web ui, and more
